In [2]:
import pandas as pd
import numpy as np

In [6]:
data = pd.read_csv('course+-+Quiz+P2-V2.csv', sep=';')

In [7]:
data.head()

   Position Sexe     Temps  Dept Temps_secondes   Age
0         1    M  00:32:23    76           1943  40.0
1         2    M  00:32:40    27           1960  34.0
2         3    M  00:33:15    76           1995  44.0
3         4    M  00:33:23    76           2003  46.0
4         5    M  00:33:29    76           2009  26.0

In [8]:
data.shape

(340, 6)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Position        340 non-null    int64
 1   Sexe            338 non-null    object
 2   Temps           340 non-null    object
 3   Dept            340 non-null    int64
 4   Temps_secondes  340 non-null    object
 5   Age             336 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 16.1+ KB

In [11]:
dept_valid = [76, 27, 14]
data.loc[~data['Dept'].isin(dept_valid)]

     Position Sexe     Temps  Dept Temps_secondes   Age
21         22    M  00:36:22    78           2182  40.0
35         36    M  00:37:31    78           2251  42.0
74         75    M  00:42:06    78           2526  57.0
255       256    M  00:55:08    78           3308  42.0
289       290    F  00:59:09    78           3549  43.0

In [12]:
data.isnull().sum()

Position          0
Sexe              2
Temps             0
Dept              0
Temps_secondes    0
Age               4
dtype: int64

In [14]:
data['Temps'] = pd.to_datetime(data['Temps'], errors='coerce')

C:\Users\Coralie\AppData\Local\Temp\ipykernel_42640\2057076584.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data['Temps'] = pd.to_datetime(data['Temps'], errors='coerce')

In [15]:
data.isnull().sum()

Position          0
Sexe              2
Temps             1
Dept              0
Temps_secondes    0
Age               4
dtype: int64

In [22]:
data['Temps_secondes'].describe()

count      340
unique     300
top       3007
freq         3
Name: Temps_secondes, dtype: object

In [17]:
data.loc[data['Position'] <= 0]

    Position Sexe               Temps  Dept Temps_secondes   Age
43      -100    M 2024-04-22 00:39:39    27           2379  31.0

In [19]:
data.loc[data['Position'] > 340]

     Position Sexe               Temps  Dept Temps_secondes   Age
264      2640    M 2024-04-22 00:56:21    76           3381  51.0

In [24]:
data['Temps_secondes'] = pd.to_numeric(data['Temps_secondes'], errors='coerce')

In [25]:
data.describe()

,Position,Temps,Dept,Temps_secondes,Age
count,340.000000,339,340.000000,339.000000,336.000000
mean,177.061765,2024-04-22 00:49:12.138642944,56.991176,2952.138643,42.145833
min,-100.000000,2024-04-22 00:32:23,14.000000,1943.000000,18.000000
25%,85.750000,2024-04-22 00:43:20,27.000000,2600.000000,34.000000
50%,170.500000,2024-04-22 00:48:56,76.000000,2936.000000,41.500000
75%,255.250000,2024-04-22 00:55:07,76.000000,3307.000000,49.250000
max,2640.000000,2024-04-22 01:10:31,78.000000,4231.000000,174.000000
std,166.584054,NaN,25.059279,514.965773,13.963690

In [27]:
data.loc[data[['Position', 'Temps']].duplicated(keep=False)]

Empty DataFrame
Columns: [Position, Sexe, Temps, Dept, Temps_secondes, Age]
Index: []

In [28]:
data.head()

   Position Sexe               Temps  Dept  Temps_secondes   Age
0         1    M 2024-04-22 00:32:23    76          1943.0  40.0
1         2    M 2024-04-22 00:32:40    27          1960.0  34.0
2         3    M 2024-04-22 00:33:15    76          1995.0  44.0
3         4    M 2024-04-22 00:33:23    76          2003.0  46.0
4         5    M 2024-04-22 00:33:29    76          2009.0  26.0

In [30]:
data.loc[(data['Sexe'] != 'M') & (data['Sexe'] != 'F')]

     Position Sexe               Temps  Dept  Temps_secondes   Age
93         94    O 2024-04-22 00:43:46    76          2626.0  18.0
109       110  NaN 2024-04-22 00:44:39    27          2679.0  53.0
167       168    O 2024-04-22 00:48:53    76          2933.0  24.0
291       292  NaN 2024-04-22 00:59:16    27          3556.0  66.0